Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_JVVNL.c
void displayCoverOpenStatus(void)
{// this function gets called every second if cover open is recorded
	ext_rtc_t datetime;
  R_WDT_Restart();
	
	if(holdState==0)
	{
		holdState=1;
		g_cover_display_state=0;
	}
	
	switch(g_cover_display_state)
	{
		case 0:
			if((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) != 0)
			{// here cover is open
				if((disp_timer%2)==0)	
				{
					LCD_DisplayDigit(2, LCD_CHAR_C);
					LCD_DisplayDigit(3, LCD_MINUS_SIGN);
					LCD_DisplayDigit(4, 0);
					LCD_DisplayDigit(5, LCD_CHAR_P);
					LCD_DisplayDigit(6, LCD_CHAR_E);
					LCD_DisplayDigit(7, LCD_CHAR_N);
				}
				else
				{
					LCD_DisplayDigit(2, LCD_CLEAR_DIGIT);
					LCD_DisplayDigit(3, LCD_CLEAR_DIGIT);
					LCD_DisplayDigit(4, LCD_CLEAR_DIGIT);
					LCD_DisplayDigit(5, LCD_CLEAR_DIGIT);
					LCD_DisplayDigit(6, LCD_CLEAR_DIGIT);
					LCD_DisplayDigit(7, LCD_CLEAR_DIGIT);
				}
				fast_display_flag=1;
				if(disp_timer>=10)
					g_cover_display_state++;
			}
			else
			{// here there is no cover tamper
				LCD_DisplayDigit(1, LCD_CHAR_C);
				LCD_DisplayDigit(2, LCD_MINUS_SIGN);
				LCD_DisplayDigit(3, LCD_CHAR_C);
				LCD_DisplayDigit(4, LCD_CHAR_L);
				LCD_DisplayDigit(5, 0);
				LCD_DisplayDigit(6, 5);
				LCD_DisplayDigit(7, LCD_CHAR_E);
				fast_display_flag=0;
				holdState=0;	// resume normal sequencing
			}
			break;
			
		case 1:	// show the date
			EPR_Read(EVENTS5_BASE_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_date(datetime.date,datetime.month,datetime.year);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, 0);
			fast_display_flag=0;
			g_cover_display_state++;
			break;
			
		case 2:	// show the time
			EPR_Read(EVENTS5_BASE_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_time(datetime.hour,datetime.minute,datetime.second);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, 0);
			fast_display_flag=0;
			holdState=0;	// resume normal sequencing
			break;
	}
}

void displayMagnetTamperStatus(void)
{
//	ext_rtc_t datetime;
	tmprdetails_t earlierTamperDetails;	
	uint32_t dc_mag_mask;
	uint32_t ac_mag_mask;
	
  R_WDT_Restart();
	
	if(holdState==0)
	{
		holdState=1;
		g_magnet_display_state=0;
	}
	
	dc_mag_mask = computeMask(MAGNET);
	ac_mag_mask = computeMask(AC_MAGNET);
	
	switch(g_magnet_display_state)
	{
		case 0:
			if(((mytmprdata.tamperEvent_once&dc_mag_mask) != 0)||((mytmprdata.tamperEvent_once&ac_mag_mask) != 0))
			{// here a magnet tamper has been recorded at least once
				LCD_DisplayDigit(1, LCD_CHAR_M);
				LCD_DisplayDigit(2, LCD_CHAR_A);
				LCD_DisplayDigit(3, LCD_CHAR_G);
				LCD_DisplayDigit(4, LCD_CHAR_T);
				LCD_DisplayDigit(5, LCD_CHAR_M);
				LCD_DisplayDigit(6, LCD_CHAR_P);
				LCD_DisplayDigit(7, LCD_CHAR_R);
				g_magnet_display_state++;
			}
			else
			{// here there is no magnet tamper in the meter
				LCD_DisplayDigit(1, LCD_CHAR_M);
				LCD_DisplayDigit(2, LCD_CHAR_A);
				LCD_DisplayDigit(3, LCD_CHAR_G);
				LCD_DisplayDigit(4, LCD_MINUS_SIGN);
				LCD_DisplayDigit(5, LCD_CHAR_N);
				LCD_DisplayDigit(6, LCD_CHAR_I);
				LCD_DisplayDigit(7, LCD_CHAR_L);
				holdState=0;	// resume normal sequencing
			}
			break;
			
		case 1:	// show the date
			EPR_Read(LAST_OCCURED_DETAILS_ADDRESS,(uint8_t *)&earlierTamperDetails,sizeof(earlierTamperDetails));
			lcd_display_date(earlierTamperDetails.tamperTime.date,earlierTamperDetails.tamperTime.month,earlierTamperDetails.tamperTime.year);
			LCD_DisplayDigit(9, LCD_CHAR_M);
			LCD_DisplayDigit(8, LCD_CHAR_T);
			g_magnet_display_state++;
			break;
			
		case 2:	// show the time
			EPR_Read(LAST_OCCURED_DETAILS_ADDRESS,(uint8_t *)&earlierTamperDetails,sizeof(earlierTamperDetails));
			lcd_display_date(earlierTamperDetails.tamperTime.hour,earlierTamperDetails.tamperTime.minute,earlierTamperDetails.tamperTime.second);
			LCD_DisplayDigit(9, LCD_CHAR_M);
			LCD_DisplayDigit(8, LCD_CHAR_T);
			g_magnet_display_state++;
			holdState=0;	// resume normal sequencing
			break;
	}
}


void display_autoScroll(void)
{
	float32_t tempFloat;
	int32_t tempTodKwh;
	int32_t tempLong;
	int32_t tempLong1;
	uint16_t tempTodMD;
	uint16_t tempint;
  int16_t i[EM_NUM_OF_LINE];
	
	ext_rtc_t datetime;
	EM_PF_SIGN pf_sign;    
	uint8_t tempchar;
	uint8_t tmonth;

  R_WDT_Restart();
  LCD_ClearAll();	
	
	if(comm_mode!=0)
	{
		LCD_DisplayDigit(2, LCD_CHAR_D);
		LCD_DisplayDigit(3, LCD_CHAR_N);
		LCD_DisplayDigit(4, LCD_CHAR_L);
		LCD_DisplayDigit(5, LCD_CHAR_D);
		return;
	}
	
//	if(disp_state>0)
		EM_LCD_DisplayStatus();

	if(disp_state>2)
		disp_state=0;

	switch(disp_state)
	{
		case 0:
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kwh/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
			break;
			
    case 1:		// cover open status
			displayCoverOpenStatus();
			break;
			
    case 2:		// magnet tamper status
			displayMagnetTamperStatus();
			break;
	}
}

void display_onDemand(void)
{
//	toddata_t temptoddata;
//	int32_t tempTodKwh;
  powermgmt_mode_t power_mode;
	int32_t tempLong;
	uint16_t tempint;
	ext_rtc_t datetime;
	EM_PF_SIGN pf_sign;    
	uint8_t tempchar;
	uint8_t tmonth;

  R_WDT_Restart();
  LCD_ClearAll();

	power_mode = POWERMGMT_GetMode();	// actual function to be used
	if (power_mode == POWERMGMT_MODE1)
		EM_LCD_DisplayStatus();

	if(disp_state==255)
		disp_state=0;
		
	if(disp_state>21)
		disp_state=0;	// cannot be increased by more than 14 - last state
	
		
	switch(disp_state)
	{
    case 0:			// all on
      LCD_DisplayAll();
			fast_display_flag=0;
			disp_autoscroll_interval=5;
      break;

    case 1:		// meter number
		  lcd_display_multiple_chars(0,6,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(Common_Data.meterNumber, LCD_LAST_POS_DIGIT,0);
			lcd_display_id();
			fast_display_flag=0;
			disp_autoscroll_interval=10;
     	break;
			
    case 2:		// time
			EM_DisplayInstantTime();
			fast_display_flag=1;
      break;

    case 3:		// date
			EM_DisplayDate();
			fast_display_flag=0;
      break;

    case 4:		// kWH
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kwh/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
     break;

    case 5:		// kVAH
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kvah/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykVAhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
     break;

    case 6:		// kVArH-lag
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kvarh_lag/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykVArhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
    	LCD_DisplaySpSign(S_LAG);
			fast_display_flag=0;
     break;

